Whats_new/app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE ("chats"."sender_id" = 76 OR "chats"."receiver_id" = 76) ORDER BY "chats"."updated_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (76, 80)
---
  def index
    @chats = Chat.for_user(current_user)
                 .includes(:sender, :receiver)
                 .order(updated_at: :desc)

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 69 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 12 ORDER BY "messages"."created_at" DESC
---
  def show
    @chat = Chat.find(params[:id])
    authorize! :read, @chat
    @sender = @chat.sender
    @receiver = @chat.receiver
    @messages = @chat.messages.order(created_at: :asc)

INSERT INTO "chats" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES (77, 89, '2025-06-13 19:28:51.618737', '2025-06-13 19:28:51.618737') RETURNING "id"
---
  def create
    @chat = Chat.new(chat_params)
    if @chat.save

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 12 LIMIT 1
---
  def edit
    @chat = Chat.find(params[:id])