Whats_new/app/controllers/messages_controller.rb

    def create
      @message = Message.new(message_params)
      chat = Chat.find(message_params[:chat_id])
      @message.user_id = chat.sender_id
      if @message.save
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 59 LIMIT 1
INSERT INTO "messages" ("chat_id", "user_id", "body", "created_at", "updated_at") VALUES (59, 80, 'hola', '2025-06-13 16:01:30.318378', '2025-06-13 16:01:30.318378') RETURNING "id"

    def edit
      @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 14 LIMIT 1

    def update
    @message = Message.find(params[:id])
    if @message.update(message_params)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 14 LIMIT 1
UPDATE "messages" SET "body" = 'Mensaje 1 del usuario 17 en chat 12. editado', "updated_at" = '2025-05-16 18:56:48.785757' WHERE "messages"."id" = 14