Whats_new/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 15 AND "messages"."id" IN (NULL) ORDER BY "messages"."created_at" DESC
---
  def show
    @user     = User.find(params[:id])
    @s_chats    = @user.sent_chats
    @r_chats    = @user.received_chats
    @messages = @user.sent_messages.order(created_at: :desc)

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at", "remember_created_at", "encrypted_password") VALUES ('medelasotta@miuandes.com', 'Matías', 'De la sotta', '2025-05-30 20:42:07.835799', '2025-05-30 20:42:07.835799', NULL, NULL, NULL, '') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 15 LIMIT 1
UPDATE "users" SET "first_name" = 'First1 changed', "updated_at" = '2025-05-16 18:12:50.434318' WHERE "users"."id" = 14
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)