Whats_new/app/views/messages/_form.html.erb

SELECT "chats".* FROM "chats"
---
    <%= form.label :chat_id, "Chat" %><br>
    <%= form.select :chat_id,
          Chat.all.map { |chat|

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, "User" %><br>
    <%= form.select :user_id,
          User.all.map { |u|