Whats_new/app/views/messages/new.html.erb

SELECT "chats".* FROM "chats"
---
      <%= f.label :chat_id %>
      <%= f.select :chat_id, Chat.all.collect { |chat| [chat.sender.first_name + " to " + chat.receiver.first_name, chat.id] }, prompt: "Select Chat" %>