Whats_new/app/views/chats/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :sender_id, "Sender" %><br>
    <%= form.select :sender_id,
          User.all.map { |user|

SELECT "users".* FROM "users"
---
    <%= form.label :receiver_id, "Receiver" %><br>
    <%= form.select :receiver_id,
          User.all.map { |user|