Whats_new/app/views/chats/new.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :sender_id %>
      <%= f.select :sender_id, User.all.collect { |user| [user.first_name, user.id] }, prompt: "Select Sender" %>

SELECT "users".* FROM "users"
---
      <%= f.label :receiver_id %>
      <%= f.select :receiver_id, User.all.collect { |user| [user.first_name, user.id] }, prompt: "Select Receiver" %>